app/controllers/home_controller.rb

  def index

    @like_opinion = Opinion.new
    @like_opinion.like = true
    @like_opinion.action_type = 1

    @dislike_opinion = Opinion.new
    @dislike_opinion.like = false
    @dislike_opinion.action_type = 1

    @opinion_form = Opinion.new
    @opinion_form.like = true
    @opinion_form.action_type = 2

    @other_opinions = []
    @my_opinions = []

    @opinions = Opinion.find_by_topic(getCurrentTopic, getCurrentSessionUser, true)
---
SELECT * FROM "topics" WHERE (time_to_show > '2010-12-14 12:43:09') ORDER BY time_to_show DESC LIMIT 1