app/controllers/opinions_controller.rb

SELECT "opinions".* FROM "opinions" WHERE ("opinions".topic_attribute_id = 1)
SELECT * FROM "topic_attributes" WHERE (lower(text) = 'lily') LIMIT 1
SELECT count(*) AS count_all FROM "opinions" WHERE ("opinions".topic_attribute_id = NULL)
---
  def create
    @opinion = getCurrentSessionUser.opinions.new(params[:opinion])

    @opinion_text = params[:opinion_text].strip

    if !(@topic_attribute = TopicAttribute.find(:first, :include => :opinions, :conditions => [ "lower(text) = ?", @opinion_text.downcase]))
      @topic_attribute = TopicAttribute.new

      @topic_attribute.text = @opinion_text

      @new_topic_attribute = true

    else

      @new_topic_attribute = false

    end

    @attrib_opinions_count = @topic_attribute.opinions.count + 1 # since new one is getting added

SELECT * FROM "session_users" WHERE ("session_users"."id" = 2)
---
    #@opinion.session_user = getCurrentSessionUser
    @opinion.topic_attribute = @topic_attribute

    current_session_user = SessionUser.find(getCurrentSessionUser.id)

INSERT INTO "opinions" ("created_at", "updated_at", "topic_attribute_id", "like_int", "action_type", "session_user_id") VALUES('2010-12-15 16:21:45', '2010-12-15 16:21:45', 3, -1, 1, 11)
UPDATE "session_users" SET "updated_at" = '2010-12-15 16:21:12', "weight" = 0.5 WHERE "id" = 11
---

    current_session_user.weight = 1.0 / @session_user_opinions_count

    current_session_user.save

INSERT INTO "topic_attributes" ("created_at", "updated_at", "text", "weight") VALUES('2010-12-14 12:32:27', '2010-12-14 12:32:27', 'Lily', 1.0)
UPDATE "topic_attributes" SET "updated_at" = '2010-12-14 12:33:15', "weight" = 0.5 WHERE "id" = 1
---

    respond_to do |format|
      # HACK : Pustting a statement that needs to be executed in And clause
      if @topic_attribute.save && @opinion.save && (@similar_session_users = getCurrentSessionUser.similar_session_users || true)