app/controllers/session_users_controller.rb

  def index
    @session_users = SessionUser.find(:all)
---
SELECT * FROM "session_users" WHERE ("session_users"."id" = 34)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
    @session_user = SessionUser.find(params[:id])
---
SELECT * FROM "session_users" WHERE ("session_users"."id" = 2)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1