app/controllers/session_user_messages_controller.rb

  def create
    @session_user_message = SessionUserMessage.new(params[:session_user_message])

    @session_user_message.sender = getCurrentSessionUser

    respond_to do |format|
      if @session_user_message.save
---
INSERT INTO "session_user_messages" ("created_at", "receiver_id", "updated_at", "sender_id", "message") VALUES('2010-12-14 12:33:31', 2, '2010-12-14 12:33:31', 7, 'Tees mar khan')

  def destroy
    @session_user_message = SessionUserMessage.find(params[:id])
    @session_user_message.destroy
---
SELECT * FROM "session_user_messages" WHERE ("session_user_messages"."id" = 1)
DELETE FROM "session_user_messages" WHERE "id" = 1