app/controllers/topic_attributes_controller.rb

SELECT * FROM "topic_attributes" WHERE ("topic_attributes"."id" = 7)
SELECT * FROM "opinions" WHERE ("opinions".topic_attribute_id = 14)
DELETE FROM "opinions" WHERE "id" = 45
DELETE FROM "topic_attributes" WHERE "id" = 7
---
  def destroy
    @topic_attribute = TopicAttribute.find(params[:id])

    @topic_attribute.opinions.each do |opinion|
      opinion.destroy
    end

    @topic_attribute.destroy