app/controllers/topics_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def show
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 2)
---
  def edit
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "created_at", "image_url", "updated_at", "image_attribution_text", "time_to_show", "description") VALUES('Friends', '2010-12-14 11:44:26', 'http://farm4.static.flickr.com/3280/2855879728_e7282c6139_o.jpg', '2010-12-14 11:44:26', '', '2010-12-14 11:44:00', 'Sitcom')
---
  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 2)
UPDATE "topics" SET "updated_at" = '2010-12-18 14:45:12', "name" = 'How I Met Your Mother', "image_url" = '/images/thimym.jpg' WHERE "id" = 2
---
  def update
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])