app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('', '2af423567194116abf5334bc3d4a6ebaf74adbb5', '2010-12-17 13:44:41', NULL, '0fa46fdcd91b1f8f82b6ddc5e12c809e48a317b8', NULL, '2010-12-17 13:44:41', 'b450ce67692fd050321b195075ccaf33b44aec89', NULL, 'amitamb', 'amitamb@gmail.com')

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = '0002cdc66101c82d7b368506e1aedd3b6a8b0b96') LIMIT 1